app/controllers/listings_controller.rb

  def index
    @listings = Listing.all
---
SELECT "listings".* FROM "listings"   ORDER BY created_at DESC

  def create
    @listing = Listing.new(listing_params)
    @listing.user_id = current_user.id
    respond_to do |format|
      if @listing.save
---
INSERT INTO "listings" ("created_at", "description", "image", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-05-03 17:58:00.771621"], ["description", "Maxi Dress"], ["image", "UOMaxi.jpg"], ["name", "Dress"], ["price", "49.99"], ["updated_at", "2015-05-03 17:58:00.771621"]]

  def update
    respond_to do |format|
      if @listing.update(listing_params)
---
UPDATE "listings" SET "image" = ?, "updated_at" = ? WHERE "listings"."id" = 1  [["image", "UOMaxi.jpg"], ["updated_at", "2015-05-03 18:39:21.002393"]]